lab_1/09_use_case_diagram.md
```mermaid
graph LR
    subgraph "Пользователь"
        A((Пользователь))
    end

    subgraph "Администратор"
        B((Администратор))
    end

    subgraph "Прецеденты"
        UC1[Регистрация]
        UC2[Вход в систему]
        UC3[Управление личным кабинетом]
        UC4[Присоединение к видеоконференции]
        UC5[Отправка сообщений в чат]
        UC6[Создание чата]
        UC7[Демонстрация экрана]
        UC8[Просмотр истории сообщений]
        UC9[Блокировка пользователя]
    end

    A --> UC1
    A --> UC2
    A --> UC3
    A --> UC4
    A --> UC5
    A --> UC6
    A --> UC7
    A --> UC8

    B --> UC9

```
